# Напишите программу, которая вводит трёхзначное число и разбивает его на цифры.
# Например, при вводе числа 123 программа должна вывести «1 – 2 – 3».

n = str(input())
print(f"{n[0]} – {n[1]} – {n[2]}")
